"""
שאלה 1 – שלושת הציונים הגבוהים והנמוכים
יש לך רשימה של ציונים (מותר שיהיו כפילויות):

grades = [78, 92, 65, 92, 81, 74, 99, 67, 88, 99]

כללים:

מיין את הרשימה מהגבוה לנמוך באמצעות מיון
הדפס את 3 הציונים הגבוהים ביותר (מותר כפילויות)
לאחר מכן מיין את הרשימה מהנמוך לגבוה
הדפס את 3 הציונים הנמוכים ביותר
אין להשתמש ב־set – הכפילויות חייבות להישאר
רמז: אפשר להשתמש ב־sort או sorted
"""

grades = [78, 92, 65, 92, 81, 74, 99, 67, 88, 99]
grades.sort()
print(grades[-3:])
print(grades[0:3])

grades = [78, 92, 65, 92, 81, 74, 99, 67, 88, 99]
print(sorted(grades)[-3:])
print(sorted(grades)[:3])

#לקח לי זמן להבין שבפונקציית סורטד צריך שהטווח לא יהיה בסוגריים של הציונים